# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [5]:
cur.execute('''SELECT firstname, lastname FROM employees JOIN offices using(officeCode) WHERE city='Boston';''')
cur.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [6]:
cur.execute('''SELECT city, COUNT(*) FROM offices LEFT JOIN employees USING (officeCode) GROUP BY 1;''')
df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

## Write 3 Questions of your own and answer them

In [ ]:
#1. Which product brings in the most revenue?
#2. Which salesperson brings in the most revenue?
#3. Which office has the most employees?

In [14]:
cur.execute('''SELECT productName, MSRP FROM products p JOIN orderdetails od USING(productcode) ORDER BY quantityOrdered''')
df = pd.DataFrame(cur.fetchall())
df.head()

                             0       1
0           1968 Dodge Charger  117.44
1  1913 Ford Model T Speedster  101.31
2        1961 Chevrolet Impala   80.84
3  1954 Greyhound Scenicruiser   54.11
4  American Airlines: B767-300   91.34

In [19]:
cur.execute('''SELECT firstname, lastname FROM employees e JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber JOIN payments USING(customernumber) ORDER BY amount DESC''')
df = pd.DataFrame(cur.fetchall())
df.head()

        0          1
0   Steve  Patterson
1    Andy     Fixter
2   Steve  Patterson
3    Andy     Fixter
4  Pamela   Castillo

In [24]:
cur.execute('''SELECT city, COUNT(*) FROM offices LEFT JOIN employees USING (officeCode) GROUP BY (1) ORDER BY COUNT(*) DESC;''')
df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0  San Francisco  6
1          Paris  5
2         Sydney  4
3         Boston  2
4         London  2

## Level Up: Display the names of each product each employee has sold.

In [8]:
cur.execute('''SELECT firstName, lastName, productName FROM employees e JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber JOIN orders o using(customerNumber) JOIN orderdetails od USING(orderNumber) JOIN products p USING(productCode)''')
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head()

2996

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [9]:
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!